# Home-work-2
## Задача 1. Приветствие.

**Условие.** Напишите программу, запрашивающую у пользователя его имя. В ответ
на ввод на экране должно появиться приветствие с обращением по имени,
введенному с клавиатуры ранее.


a = input('Представтесь: ')
print('Добро пожаловать:', a)

## Задача 2. Сувениры и безделушки.

**Условие.** Интернет-магазин занимается продажей различных сувениров и безделушек. Каждый сувенир весит 75 г, а безделушка – 112 г. Напишите программу, запрашивающую у пользователя количество тех и других покупок,
после чего выведите на экран общий вес посылки.


souvenir = int(input('Введите количество сувениров:'))
A_trinket = int(input('Введите количество безделушек:'))

souvenir_weight = 0.75
A_trinket_weight = 0.112

souvenir_total = souvenir * souvenir_weight
A_trinket_total = A_trinket * A_trinket_weight

total_amount = souvenir_total + A_trinket_total

print('Общий вес посылки составит:', total_amount, 'кг')

## Задача 3. Сложные проценты

**Условие.** Представьте, что вы открыли в банке сберегательный счет под 4 % годовых. Проценты банк рассчитывает в конце года и добавляет к сумме счета.
Напишите программу, которая запрашивает у пользователя сумму первоначального депозита, после чего рассчитывает и выводит на экран сумму
на счету в конце первого, второго и третьего годов. Все суммы должны
быть округлены до двух знаков после запятой.



def calculate_deposit():
    initial_deposit= float(input("Введите сумму первоначального депозита: "))
    annual_interest_rate = float(input("Введите годовую процентную ставку (в процентах): "))
    interest_rate = annual_interest_rate / 100
    for year in range(1, 4):
        amount = initial_deposit * (1 + interest_rate) ** year
        print(f"Сумма на счету в конце {year}-го года: {amount:.2f}")

calculate_deposit()

## Задача 4. Арифметика

**Условие.** Создайте программу, которая запрашивает у пользователя два целых числа a и b, после чего выводит на экран результаты следующих математических операций:
* сумма a и b;
* разница между a и b;
* произведение a и b;
* частное от деления a на b;
* остаток от деления a на b;
* десятичный логарифм числа a;
* результат возведения числа a в степень b.

import math
a = int(input('Ведите первое значение: '))
b = int(input('Ведите пвторое значение: '))

sum = (a+b)
difference = (a-b)
multiplication = (a*b)
quotient = (a/b)
remainder_division = (a%b)
log10 = math.log10(a)
exponentiation = (a**b)

print("Сумма", sum)
print("Разница", difference)
print("Произведение", multiplication)
print("Частное от деления:", quotient)
print("Остаток от деления", remainder_division)
print("Десятичный логарифм", log10)
print("Результат возведения числа", exponentiation)


## Задача 5. Размен

**Условие.** Представьте, что вы пишете программное обеспечение для автоматической кассы в  магазине самообслуживания. Одной из функций, заложенных в кассу, должен быть расчет сдачи в случае оплаты покупателем наличными.
Напишите программу, которая будет запрашивать у пользователя сумму сдачи в копейках. После этого она должна рассчитать и вывести на экран, сколько и каких монет потребуется для выдачи указанной суммы, при условии что должно быть задействовано минимально возможное количество монет. Допустим, у нас есть в распоряжении монеты достоинством в 1, 5, 10, 50 копеек, а также в 1, 2 и 5 рублей.


def calculate_change(change_amount):
    coins = [500, 200, 100, 50, 10, 5, 1]
    change = {}

    for coin in coins:
        if change_amount >= coin:
            count = change_amount // coin
            change[coin] = count
            change_amount -= coin * count

    return change

def print_change(change):                            #
    for coin, count in change.items():               # я понимал что мне нужны были
        if coin >= 100:                              # if и else
            print(f"{coin // 100} рублей: {count}")  # но не мог собразить как конкретно их написать
        else:                                        # бот помог, дал немного другой вариант
            print(f"{coin} копеек: {count}")         # я его переделал по нужный мне

def main():
    try:
        change_amount = int(input("Введите сумму сдачи в копейках: "))
        if change_amount < 0:
            print("Сумма сдачи не может быть отрицательной.")
            return

        change = calculate_change(change_amount)


        print("Сдача:")
        print_change(change)

    except ValueError:
        print("Пожалуйста, введите корректное числовое значение.")

if __name__ == "__main__":
    main()


## Задача 6. Вчерашний хлеб

**Условие.** Пекарня продает хлеб по 49 рублей за буханку. Скидка на вчерашний хлеб составляет 60 %. Напишите программу, которая будет запрашивать у пользователя количество приобретенных вчерашних буханок хлеба. В вывод на экран должны быть включены обычная цена за буханку, цена со скидкой и общая стоимость приобретенного хлеба. Все значения должны быть выведены на отдельных строках с соответствующими описаниями. Используйте для вывода формат с двумя знаками после запятой и 5-ю знакоместами.


price_bread = 49.00
discount = 0.60

Yest_bread = int(input("Введите количество приобретенных вчерашних буханок: "))

price_bread_discount = price_bread * (1 - discount)
total_all = Yest_bread * price_bread_discount

print(f"Обычная цена за буханку: {price_bread:5.2f} руб.")
print(f"Цена со скидкой за буханку: {price_bread_discount :5.2f} руб.")
print(f"Общая стоимость: {total_all:5.2f} руб.")
